{
  "company_name": "Motorcade Technology",
  "company_description": "Hochwertige LKW-Maschinenlösungen für Ihre industriellen Bedürfnisse.",
  "quick_links": "Schnellzugriff",
  "home": "Startseite",
  "about": "Über Uns",
  "products": "Produkte",
  "news": "Neuigkeiten",
  "contact": "Kontakt",
  "contact_us": "Kontaktiere uns",
  "get_in_touch": "Kontakt aufnehmen",
  "contact_description": "Haben Sie Fragen oder benötigen Unterstützung? Kontaktieren Sie uns, wir helfen Ihnen gerne weiter.",

  "contact_info": "Kontaktinformationen",
  "contact_info_description": "Zögern Sie nicht, uns über die folgenden Kanäle zu kontaktieren. Wir sind für Sie da.",

  "visit_us": "Besuchen Sie uns",
  "address": "Einheit 1207, Gebäude 1, Nr. 288, Zhuhai East Road, Jiaonan City, Qingdao",

  "call_us": "Rufen Sie uns an",
  "phone1": "+8617864268032",
  "phone2": "+8617852160455",

  "whatsapp": "WhatsApp",
  "chat_now": "Jetzt chatten",
  
    "wechat": "Wechat",
    "scan_qr_to_chat": "Scannen Sie den QR-Code, um zu chatten",
  
  

  "email_us": "Schreiben Sie uns eine E-Mail",
  "email": "13061287760@163.com",

  "operating_hours": "Öffnungszeiten",
  "monday_friday": "Montag - Freitag",
  "saturday": "Samstag",
  "sunday": "Sonntag",
  "closed": "Geschlossen",

  "follow_us": "Folgen Sie uns",
  "all_rights_reserved": "Alle Rechte vorbehalten.",

  "your_name": "Ihr Name",
  "email_address": "E-Mail-Adresse",
  "subject": "Betreff",
  "your_message": "Ihre Nachricht",
  "send_message": "Nachricht senden",
  "send_message_description": "Füllen Sie das Formular aus und unser Team wird sich bald bei Ihnen melden.",
  "message_sent": "Nachricht gesendet",
  "message_sent_description": "Wir werden uns bald bei Ihnen melden.",
  "message_error": "Fehler",
  "message_error_description": "Nachricht konnte nicht gesendet werden",
  "processing": "Verarbeitung...",

  "locale": "de-DE",
  "read_more": "Weiterlesen",
  "published_on": "Veröffentlicht am",
  "category": "Kategorie",
  "latest_news": "Neueste Nachrichten",

  "view_details": "Details anzeigen",
    "latest_products": "Neueste Produkte",

    "story_information": "Qingdao Auto Motorcade Technology Company Limited ist ein dynamisches und vielseitiges Unternehmen, das an der Schnittstelle von Innovation, exzellenter Ingenieurskunst und industriellem Wachstum tätig ist. Mit vier eigenständigen Produktionsunternehmen ist unsere Organisation ein führender Hersteller von Baugeräten, Schwermaschinen und großformatigen Automobilausrüstungen. Jedes unserer Werke bringt einzigartiges Know-how und spezielle Fähigkeiten mit, wodurch unser Unternehmen als führender Akteur in der globalen Industrie- und Fertigungsbranche positioniert ist.\n\nUnser Unternehmen ist auf die Entwicklung und Herstellung modernster Baugeräte spezialisiert, darunter Bagger, Planierraupen, Kräne und Lader. Diese Maschinen sind für den Einsatz in anspruchsvollen Umgebungen konzipiert und ermöglichen weltweit den Bau von Infrastrukturen. Unsere Ausrüstung ist bekannt für ihre Langlebigkeit, Effizienz und fortschrittliche Technologie, weshalb sie von Bauunternehmen und Auftragnehmern bevorzugt wird.\n\nUnser Unternehmen konzentriert sich auch auf Schwermaschinen für Branchen wie Bergbau, Landwirtschaft und Logistik. Dazu gehören Maschinen wie Bohrgeräte, Erntemaschinen und Materialhandhabungssysteme. Unsere Maschinen sind so konstruiert, dass sie die Produktivität maximieren und gleichzeitig die Umweltbelastung minimieren, um mit den globalen Nachhaltigkeitszielen im Einklang zu stehen.\n\nEin weiterer Schwerpunkt unseres Unternehmens liegt in der Automobilbranche, wo wir großformatige Automobilausrüstungen wie Nutzfahrzeuge, Industriefahrzeuge und spezialisierte Transportlösungen herstellen. Diese Fahrzeuge sind für schwere Einsätze konzipiert und gewährleisten Zuverlässigkeit sowie Leistung unter anspruchsvollen Bedingungen.\n\nZudem ist unser Unternehmen auf die Herstellung essenzieller Komponenten und Systeme spezialisiert, die das gesamte industrielle Ökosystem unterstützen. Dazu gehören Motoren, Hydrauliksysteme und Automatisierungstechnologien, die für die Funktionalität von Bau- und Automobilausrüstungen entscheidend sind.\n\nWir investieren erheblich in Forschung und Entwicklung, um Innovationen in den Bereichen Automatisierung, Elektrifizierung und intelligente Technologien voranzutreiben. Dadurch bleibt unser Produktportfolio an der Spitze der Branche. Mit einer starken Lieferkette und einer Präsenz in zahlreichen Märkten bedienen wir Kunden weltweit – von Schwellenländern bis hin zu Industrienationen.\n\nUnser Unternehmen engagiert sich für die Reduzierung seines CO₂-Fußabdrucks, indem wir energieeffiziente Maschinen entwickeln und umweltfreundliche Produktionsverfahren anwenden. Durch maßgeschneiderte Lösungen und herausragenden Kundensupport konnten wir langfristige Kundenbeziehungen aufbauen.\n\nUnsere Vision ist es, die Fertigungsindustrie durch qualitativ hochwertige, innovative und nachhaltige Lösungen zu revolutionieren, die Unternehmen und Gemeinschaften weltweit stärken. Unsere Mission ist es, industriellen Fortschritt durch modernste Technologie, operative Exzellenz und ein starkes Engagement für Umweltschutz voranzutreiben.\n\nDa die Welt zunehmend auf intelligentere und umweltfreundlichere Technologien setzt, ist Qingdao Auto Motorcade Technology Company Limited bestens positioniert, um die nächste Generation der Fertigungsindustrie anzuführen. Durch die digitale Transformation, die Expansion in aufstrebende Märkte und den Aufbau strategischer Partnerschaften sind wir für nachhaltiges Wachstum und langfristigen Erfolg gerüstet.\n\nQingdao Auto Motorcade Technology Company Limited ist nicht nur ein Hersteller – wir sind ein Motor des Fortschritts und gestalten die Zukunft der Bau-, Maschinen- und Automobilindustrie.",
    "our_story": "Unsere Geschichte",
    "about_us": "Über uns",
  "story_mission": "Unsere Geschichte und Mission",
  "learn_about_us": "Erfahren Sie mehr über unsere Reise, um ein führender Anbieter von Premium-Lösungen für Lkw-Maschinen zu werden.",
  "cont_abouta_us": "Im Laufe der Jahrzehnten haben wir unser Produktportfolio erweitert, technologische Innovationen angenommen und dauerhafte Beziehungen zu Kunden weltweit aufgebaut. Unser Engagement für Qualität und Kundenzufriedenheit blieb über die gesamte Reise hinweg unverändert.",
  "cont_abouta_us_par": "Heute setzen wir weiterhin neue Maßstäbe für das, was in der Lkw-Maschinenbranche möglich ist, und streben stets danach, Produkte zu liefern, die die Erwartungen übertreffen und unseren Kunden helfen, in ihren Projekten erfolgreich zu sein.",
  "our_impact_in_numbers": "Unsere Auswirkungen in Zahlen",
  "our_impact_in_numbers_1": "Im Laufe der Jahre haben wir dank unserer Hingabe zur Exzellenz wichtige Meilensteine erreicht.",
  "about.stats.experience": "Jahre der Erfahrung",
  "about.stats.clients": "Zufriedene Kunden",
  "about.stats.projects": "Abgeschlossene Projekte",
  "about.stats.countries": "Bediente Länder",
  "our_mission": "Unsere Mission und Vision",
  "mission_1": "Innovative, zuverlässige und effiziente Lösungen für Lkw-Maschinen anzubieten, die unseren Kunden helfen, in ihren Branchen erfolgreich zu sein.",
  "mission_2": "Die Branche in Produktqualität, technischer Innovation und Kundenzufriedenheit anzuführen.",
  "mission_3": "Ethische Geschäftspraktiken und nachhaltige Operationen in unserer globalen Lieferkette beizubehalten.",
  "mission_4": "Als vertrauenswürdiger Partner für Bau- und Industriegeräte weltweit anerkannt zu werden.",
  "our_core_values": "Unsere Kernwerte",
  "our_core_description": "Diese Prinzipien leiten unsere Entscheidungen und Handlungen jeden Tag.",
  "core.value.1": "Exzellenz",
  "core.value.1.description": "Wir streben in jedem Aspekt unseres Geschäfts nach Exzellenz, von der Qualität unserer Maschinen bis hin zu unserem Kundenservice.",
  "core.value.2": "Zusammenarbeit",
  "core.value.2.description": "Wir glauben daran, eng mit unseren Kunden zusammenzuarbeiten, um ihre einzigartigen Bedürfnisse zu verstehen und maßgeschneiderte Lösungen anzubieten.",
  "core.value.3": "Innovation",
  "core.value.3.description": "Wir suchen ständig nach neuen Technologien und Ansätzen, um unsere Produkte und Dienstleistungen zu verbessern.",
  "our_leadership_team": "Unser Führungsteam",
  "our_leadership_team_description": "Lernen Sie die Experten kennen, die unsere Vision vorantreiben.",
  
  
    "ceo_name": "Leo Miao",
    "chief_executive_officer": "Geschäftsführer",
    "chief_executive_officer_experience": "Mit über 25 Jahren Branchenerfahrung führt Leo Miao unser Unternehmen mit Vision und Fachwissen."
  
  
  
  ,
  "cto_name": "Sarah Chen",
  "chief_technology_officer": "Chief Technology Officer",
  "chief_technology_officer.experience": "Sarah treibt unsere technologischen Innovationen voran und stellt sicher, dass unsere Produkte an der Spitze bleiben.",
  "cpo_name": "Michael Rodriguez",
  "chief_operations_officer": "Chief Operations Officer",
  "chief_operations_officer_experience": "Michael sorgt dafür, dass unsere globalen Fertigungs- und Vertriebsnetze reibungslos funktionieren.",

  
    "category.all": "Alle",
    "category.excavator": "Bagger",
    "category.loader": "Lader",
    "category.roller": "Walze",
    "category.truck": "Lkw",
    "category.bulldozer": "Bulldozer",
    "category.underground_machines": "Untergrundmaschinen",
    "products.1.name": "Untergrundbergbau-Lkw",
    "products.1.description": "Ein leistungsstarker und kompakter Lkw, der für effizientes Transportieren in unterirdischen Bergbauoperationen entwickelt wurde.",
    "products.2.name": "Gummiradwalze",
    "products.2.description": "Vielseitiger und wendiger Lader, perfekt für enge Räume und städtische Baustellen.",
    "products.3.name": "Hydraulische Walze mit Trommel",
    "products.3.description": "Hochkapazitive Hebelösung für große Bau- und Infrastrukturprojekte.",
    "products.4.name": "Untergrund-Bergbau-Lader",
    "products.4.description": "Kompakte und leistungsstarke Maschine, die für effizientes Materialhandling in unterirdischen Bergbauoperationen entwickelt wurde.",
    "products.5.name": "Bagger",
    "products.5.description": "Vielseitiger mittelgroßer Bagger, der für eine Vielzahl von Grab- und Grabenanwendungen geeignet ist.",
    "products.6.name": "Untergrund-Nutzfahrzeug",
    "products.6.description": "Das unterirdische Nutzfahrzeug gewährleistet den effizienten Transport von Personal und Materialien in Bergbauoperationen.",
    "products.7.name": "Kettenbulldozer",
    "products.7.description": "Leistungsstarke Erdbewegungsmaschine für große Bau- und Bergbauprojekte.",
    "products.8.name": "Räderlader",
    "products.8.description": "Effiziente Materialhandhabungsausrüstung für Lade-, Transport- und Entladeoperationen.",
    "products.9.name": "Doppeltrommelwalzen",
    "products.9.description": "Die Doppeltrommelwalze sorgt für eine effiziente Verdichtung für Straßen und Asphaltierung.",
    
      "products.10.name": "Selbstladender Betonmischer-LKW",
      "products.10.description": "Ein vielseitiger und effizienter LKW mit einem Selbstladesystem zum Mischen und Transportieren von Beton vor Ort.",
      
        "products.11.name": "Sattelschlepper",
        "products.11.description": "Ein leistungsstarker Lkw, der für das Ziehen von Sattelaufliegern entwickelt wurde und einen effizienten und zuverlässigen Transport schwerer Lasten bietet.",
        "products.12.name": "Kipper",
        "products.12.description": "Ein schwerer Lkw, der zum Transport und Entladen von Schüttgütern wie Sand, Kies oder Abbruchmaterial verwendet wird.",
      
      
    
    
    "our_catalogue": "Unser Katalog",
    "premium_truck_machinery": "Premium-Lkw-Maschinen",
    "explore_range": "Entdecken Sie unser umfangreiches Sortiment an hochwertigen Bau- und Industriemaschinen.",
    "search_products": "Produkte suchen...",

    
      "latest_updates": "Neueste Updates",
      "news_insight": "Nachrichten & Einblicke",
      "stay_informed": "Bleiben Sie informiert über unsere Unternehmensupdates, Branchentrends und Produkteinführungen.",
      "search_news": "Nachrichten suchen...",
      "category.product launch": "Produkteinführung",
      "category.industry news": "Branchennews",
      "category.company updates": "Unternehmensupdates",
      "category.events": "Veranstaltungen",
      "newest_first": "Neueste zuerst",
      "oldest_first": "Älteste zuerst",
      "category.date_1": "14. Dezember 2024",
      "category.date_2": "12. November 2024",
      "category.date_3": "9. Oktober 2024",
      "category.date_4": "4. Januar 2025",
      "category.date_5": "17. August 2024",
      "category.date_6": "12. Februar 2025",
      "news_1_title": "Minibagger – kompakte und effiziente Baumaschinen",
      "news_2_title": "MOTORCADE-TECHNOLOGY Baggerlader mit leistungsstarken Funktionen und hervorragender Leistung!",
      "news_3_title": "Allradgelenkter Geländestapler",
      "news_4_title": "🌟 2025, lass den Traum weiterleben! 🌟",
      "news_5_title": "Selbstladender Flachmischer – kleiner und flexibler Betonmischer",
      "news_6_title": "MOTORCADE TECHNOLOGY – Führt die neue Ära intelligenter Baustoffe an",
      "news_1_excerpt": "1. Klein und flexibel",
      "news_2_excerpt": "MOTORCADE-TECHNOLOGY Baggerlader mit leistungsstarken Funktionen und hervorragender Leistung!",
      "news_3_excerpt": "Der allradgelenkte Geländestapler ist ein leistungsstarkes Werkzeug für anspruchsvolles Gelände und",
      "news_4_excerpt": "Die Zahnräder der Zeit drehen sich leise, und wir haben 2025 begrüßt. Vielen Dank für Ihre Unterstützung. Ihr Vertrauen und Ihre Ermutigung treiben uns weiter voran.",
      "news_5_excerpt": "Diese Art von Mischwagen ist in engen Baustellen leichter zu bedienen. Sie eignen sich auch für",
      "news_6_excerpt": "Kürzlich wurden Mischwagen nach Südostasien, Südamerika, den Nahen Osten und Afrika exportiert und finden breite Anwendung im Straßenbau, Wohnungsbau, Brückenbau und anderen Bereichen. Wir sind fest davon überzeugt, dass Qualitätsprodukte und perfekter Service einen höheren Wert für globale Kunden schaffen werden.",
      "name_asc": "Name (A-Z)",
      "name_desc": "Name (Z-A)",
      "no_products_found": "Keine Produkte gefunden",
      "no_news_found": "Keine Nachrichten gefunden",
      "category.label": "Kategorie",

      
        "premium_truck_machinery_for_every_project": "Premium-Lkw-Maschinen für jedes Projekt",
        "discover_our_extensive_catalogue": "Entdecken Sie unseren umfangreichen Katalog leistungsstarker Bau- und Industriefahrzeuge.",
        "explore_products": "Produkte erkunden",
        "why_choose_us": "Warum uns wählen?",
        "industry_Leading_Truck_Solutions": "Branchenführende Lkw-Lösungen",
        "we_provide": "Wir bieten hochwertige Maschinen mit jahrelanger Erfahrung und exzellentem Kundenservice.",
        "premium_quality": "Premium-Qualität",
        "all_our_machines": "Alle unsere Maschinen werden aus hochwertigen Materialien gefertigt und unterliegen strengen Qualitätskontrollen.",
        "expert_maintenance": "Expertenwartung",
        "our_team_of_specialists": "Unser Team von Spezialisten bietet laufende Wartung und Serviceunterstützung.",
        "performance": "Leistung",
        "our_machine_is_designed": "Unsere Maschinen sind für maximale Effizienz und Produktivität ausgelegt.",
        "customer_support": "Kundensupport",
        "we_pride_ourselves": "Wir sind stolz auf unseren reaktionsschnellen und hilfreichen Kundenservice.",
        "featured_products": "Ausgewählte Produkte",
        "our_premium_machinery": "Unsere Premium-Maschinen",
        "view_all_products": "Alle Produkte anzeigen",
        "ready_to_upgrade_your_fleet": "Bereit, Ihre Flotte aufzurüsten?",
        "contact_our_team": "Kontaktieren Sie unser Team, um Ihre spezifischen Anforderungen zu besprechen und die perfekte Maschine für Ihre Projekte zu finden.",
        "view_all_news": "Alle Nachrichten anzeigen",

        
          "Underground mining truck": "Untertageschaufelbagger",
          "Underground machines": "Untergrundmaschinen",
          "Powerful excavator designed for the toughest construction projects with enhanced digging capabilities.": "Leistungsstarker Bagger, der für die härtesten Bauprojekte mit verbesserten Grabfähigkeiten entwickelt wurde.",
          "High payload capacity for underground hauling": "Hohe Tragfähigkeit für den unterirdischen Transport",
          "Compact design for tight tunnel navigation": "Kompakte Bauweise für enge Tunnelnavigation",
          "Heavy-duty frame for extreme conditions": "Robustes Gestell für extreme Bedingungen",
          "Advanced suspension for stability": "Fortschrittliche Federung für Stabilität",
          "Ergonomic operator cabin with safety systems": "Ergonomische Fahrerkabine mit Sicherheitssystemen",
          "Efficient cooling system for underground environments": "Effizientes Kühlsystem für unterirdische Umgebungen",
          "The Underground Mining Truck is built for high-capacity hauling in confined mining tunnels. Its powerful engine, rugged frame, and advanced suspension system ensure efficient material transport in tough underground conditions. With excellent maneuverability, operator safety features, and a durable design, it maximizes productivity in deep mining operations.": "Der Untertageschaufelbagger ist für den hochkapazitiven Transport in engen Bergbautunneln gebaut. Der leistungsstarke Motor, das robuste Gestell und das fortschrittliche Federungssystem gewährleisten einen effizienten Materialtransport unter schwierigen Bedingungen im Untergrund. Mit exzellenter Manövrierbarkeit, Sicherheitsmerkmalen für den Fahrer und einem langlebigen Design maximiert er die Produktivität bei tiefen Bergbauoperationen.",
          "engine: 'Diesel, 300–500 HP'": "Motor: 'Diesel, 300–500 PS'",
          "weight: ' 25,000–60,000 kg'": "Gewicht: '25.000–60.000 kg'",
          "payloadCapacity: '30–80 tons'": "Tragfähigkeit: '30–80 Tonnen'",
          "height: '2.5–3.5 meters'": "Höhe: '2,5–3,5 Meter'",
          " dimensions: '9m × 3m × 3m'": "Abmessungen: '9m × 3m × 3m'",
          "loading": "Wird geladen...",
          "productNotFound": "Produkt nicht gefunden",
          "productNotFoundDescription": "Das gesuchte Produkt existiert nicht.",
          "backToProducts": "Zurück zu den Produkten",
          "keyFeatures": "Hauptmerkmale",
          "technicalSpecifications": "Technische Spezifikationen",
          "requestQuote": "Angebot anfordern",
          "askQuestion": "Frage stellen",
          "relatedProducts": "Verwandte Produkte",

          
            "Rubber Wheel Roller": "Gummiradwalze",
            "Versatile and maneuverable loader perfect for tight spaces and urban construction sites.": "Vielseitiger und manövrierbarer Lader, der sich perfekt für enge Räume und städtische Baustellen eignet.",
            "The Rubber Wheel Roller is designed for high-performance compaction across various terrains. It is ideal for road construction, asphalt paving, and soil compaction, providing excellent ground coverage and uniform pressure distribution. The pneumatic tires enhance grip and adaptability, making it suitable for both urban and heavy-duty infrastructure projects.": "Die Gummiradwalze ist für eine leistungsstarke Verdichtung auf verschiedenen Geländearten ausgelegt. Sie ist ideal für den Straßenbau, Asphaltierung und Bodenverdichtung und bietet eine hervorragende Bodenabdeckung sowie eine gleichmäßige Druckverteilung. Die Luftreifen verbessern den Grip und die Anpassungsfähigkeit, wodurch sie sowohl für städtische als auch für schwere Infrastrukturprojekte geeignet ist.",
            "Roller": "Walze",
            "Pneumatic rubber tires": "Pneumatische Gummireifen",
            "Variable ballast system": "Variables Ballastsystem",
            "Hydrostatic drive": "Hydrostatischer Antrieb",
            "Multi-speed transmission": "Mehrgang-Getriebe",
            "Operator-friendly controls": "Benutzerfreundliche Steuerung",
            "Spacious & ergonomic cabin": "Geräumige und ergonomische Kabine",

            
              "Hydraulic Drum Roller": "Hydraulischer Trommelwalze",
              "High-capacity lifting solution for major construction and infrastructure projects.": "Hochkapazitive Hebelösung für große Bau- und Infrastrukturprojekte.",
              "The Hydraulic Drum Roller is a powerful and efficient compaction machine designed for road construction, foundation work, and large-scale infrastructure projects. With its hydraulic drive system, it delivers superior performance, enhanced maneuverability, and precise control, ensuring even and consistent soil and asphalt compaction. Built for durability and efficiency, this roller is an essential asset for contractors and construction professionals.": "Der hydraulische Trommelwalze ist eine leistungsstarke und effiziente Verdichtungsmaschine, die für den Straßenbau, Fundamentarbeiten und groß angelegte Infrastrukturprojekte entwickelt wurde. Mit seinem hydraulischen Antriebssystem bietet er überlegene Leistung, verbesserte Manövrierbarkeit und präzise Steuerung, wodurch eine gleichmäßige und konstante Verdichtung von Boden und Asphalt gewährleistet wird. Für Langlebigkeit und Effizienz gebaut, ist dieser Walze ein unverzichtbares Werkzeug für Bauunternehmer und Bauprofis.",
              "Hydraulic Drive System": "Hydraulisches Antriebssystem",
              "High-Impact Vibration Mechanism": "Hochimpuls-Vibrationsmechanismus",
              "Variable Frequency Control": "Variable Frequenzsteuerung",
              "Heavy-Duty Steel Drum": "Robustes Stahlband",
              "Ergonomic Operator Cabin": "Ergonomische Fahrerkabine",
              "Advanced Safety Features": "Fortschrittliche Sicherheitsmerkmale",

              
                "Underground mining loader": "Untertage-Baggerlader",
                "A compact and powerful machine designed for efficient material handling in underground mining operations.": "Eine kompakte und leistungsstarke Maschine, die für den effizienten Materialtransport im Untertage-Bergbau entwickelt wurde.",
                "The Underground Mining Loader is a powerful and compact machine designed for efficient material handling in confined mining environments. Built for durability and high productivity, it features a low-profile design, advanced hydraulics, and excellent maneuverability. Its reinforced structure and safety systems ensure reliable performance in harsh underground conditions.": "Der Untertage-Baggerlader ist eine leistungsstarke und kompakte Maschine, die für den effizienten Materialtransport in engen Bergbauumgebungen entwickelt wurde. Sie ist auf Haltbarkeit und hohe Produktivität ausgelegt und verfügt über ein niedriges Design, fortschrittliche Hydraulik und ausgezeichnete Manövrierfähigkeit. Ihre verstärkte Struktur und Sicherheitssysteme sorgen für zuverlässige Leistung unter schwierigen unterirdischen Bedingungen.",
                "Compact, low-profile design": "Kompaktes, niedriges Design",
                "High-capacity bucket for efficient loading": "Hochleistungsschaufel für effizientes Laden",
                "Powerful hydraulics for smooth operation": "Leistungsstarke Hydraulik für einen reibungslosen Betrieb",
                "Heavy-duty frame for durability": "Robustes Fahrgestell für Langlebigkeit",
                "Advanced ventilation and cooling system": "Fortschrittliches Belüftungs- und Kühlsystem",
                "Ergonomic operator cabin for comfort": "Ergonomische Fahrerhütte für Komfort",

                
                  "Excavator": "Bagger",
                  "Versatile mid-sized excavator suitable for a wide range of digging and trenching applications.": "Vielseitiger mittelgroßer Bagger, der für eine Vielzahl von Grab- und Grabenanwendungen geeignet ist.",
                  "The Excavator offers an excellent balance of power, mobility, and versatility for a wide range of construction applications. Its optimized hydraulic system delivers precise control and efficient operation, while the comfortable cabin reduces operator fatigue during extended work periods. With multiple attachment options and a compact turning radius, this excavator excels in urban construction sites and medium-scale earthmoving projects.": "Der Bagger bietet ein hervorragendes Gleichgewicht aus Leistung, Mobilität und Vielseitigkeit für eine Vielzahl von Bauanwendungen. Sein optimiertes Hydrauliksystem sorgt für präzise Kontrolle und effizienten Betrieb, während die komfortable Kabine die Ermüdung des Bedieners während längerer Arbeitsphasen verringert. Mit verschiedenen Anbaugeräten und einem kompakten Wendekreis glänzt dieser Bagger auf städtischen Baustellen und bei mittelgroßen Erdbewegungsprojekten.",
                  "Optimized hydraulic system": "Optimiertes Hydrauliksystem",
                  "Multiple attachment options": "Verschiedene Anbaugeräte",
                  "Compact turning radius": "Kompakter Wendekreis",
                  "Fuel-efficient operation": "Kraftstoffeffizienter Betrieb",
                  "Enhanced operator comfort": "Verbesserter Bedienkomfort",
                  "Low maintenance requirements": "Geringe Wartungsanforderungen",

                  
                    "Underground utility vehicle": "Unterirdisches Versorgungsfahrzeug",
                    "The Underground Utility Vehicle ensures efficient transport of personnel and materials in mining operations.": "Das unterirdische Versorgungsfahrzeug gewährleistet einen effizienten Transport von Personal und Material in Bergbauoperationen.",
                    "The Underground Utility Vehicle is an essential support machine for mining operations, designed to transport personnel, tools, and materials efficiently in underground environments. Built for durability and reliability, it features a rugged chassis, high ground clearance, and a compact design to navigate narrow tunnels and rough terrains. With its powerful engine and all-wheel drive, it ensures optimal performance even in challenging underground conditions. The vehicle is equipped with advanced safety features, including reinforced cabins, fire suppression systems, and emergency braking, ensuring operator safety in hazardous environments. Its modular design allows for multiple configurations, making it adaptable for various mining applications such as maintenance, logistics, and material handling.": "Das unterirdische Versorgungsfahrzeug ist eine wesentliche Unterstützungsmaschine für Bergbauoperationen, die dafür entwickelt wurde, Personal, Werkzeuge und Materialien effizient in unterirdischen Umgebungen zu transportieren. Es wurde für Langlebigkeit und Zuverlässigkeit gebaut und verfügt über ein robustes Fahrgestell, eine hohe Bodenfreiheit und ein kompaktes Design, um enge Tunnel und unwegsames Gelände zu befahren. Mit seinem leistungsstarken Motor und Allradantrieb gewährleistet es optimale Leistung, selbst unter schwierigen unterirdischen Bedingungen. Das Fahrzeug ist mit fortschrittlichen Sicherheitsmerkmalen ausgestattet, darunter verstärkte Kabinen, Brandschutzsysteme und Notbremsen, die die Sicherheit des Bedieners in gefährlichen Umgebungen gewährleisten. Das modulare Design ermöglicht verschiedene Konfigurationen, was es für verschiedene Bergbauanwendungen wie Wartung, Logistik und Materialhandling anpassbar macht.",
                    "Compact and durable design for underground use": "Kompaktes und robustes Design für den Untergrundgebrauch",
                    "High ground clearance for rough terrain": "Hohe Bodenfreiheit für unwegsames Gelände",
                    "All-wheel drive for enhanced traction": "Allradantrieb für verbesserte Traktion",
                    "Reinforced cabin with safety features": "Verstärkte Kabine mit Sicherheitsmerkmalen",
                    "Configurable for multiple applications": "Konfigurierbar für mehrere Anwendungen",
                    "Easy maintenance access": "Einfache Wartungszugänglichkeit",

                    
                      "Tracked Bulldozer": "Kettenbulldozer",
                      "Powerful earth-moving machine for large construction and mining projects.": "Leistungsstarke Erdbewegungsmaschine für große Bau- und Bergbauprojekte.",
                      "The Tracked Bulldozer delivers exceptional pushing power and traction for challenging earthmoving operations. Its heavy-duty tracks provide stability and low ground pressure across various soil conditions, while the hydraulically-controlled blade offers precise material handling. The pressurized cabin features advanced noise reduction and climate control, creating a comfortable environment for extended operation. With its robust construction and reliable performance, this bulldozer is ideal for land clearing, grading, and material spreading applications.": "Der Kettenbulldozer bietet außergewöhnliche Schubkraft und Traktion für anspruchsvolle Erdbewegungsarbeiten. Seine Schwerlastketten bieten Stabilität und niedrigen Bodendruck auf verschiedenen Bodenarten, während die hydraulisch gesteuerte Schaufel eine präzise Materialhandhabung ermöglicht. Die druckbelüftete Kabine verfügt über fortschrittliche Geräuschreduzierung und Klimaanlage, was eine komfortable Umgebung für längeren Betrieb schafft. Mit seiner robusten Konstruktion und zuverlässigen Leistung ist dieser Bulldozer ideal für das Roden von Land, das Nivellieren und das Verteilen von Materialien.",
                      "Bulldozer": "Bulldozer",
                      "Heavy-duty track system": "Schwerlast-Kettensystem",
                      "Hydraulic blade control": "Hydraulische Schaufelsteuerung",
                      "Pressurized operator cabin": "Druckkabine für den Bediener",
                      "Advanced noise reduction": "Fortschrittliche Geräuschreduzierung",
                      "Powerful pushing capacity": "Starke Schubkraft",
                      "Low ground pressure design": "Design mit niedrigem Bodendruck",

                      
                        "Wheeled Loader": "Radlader",
                        "Efficient material handling equipment for loading, transporting, and unloading operations.": "Effiziente Materialhandhabungsgeräte für Lade-, Transport- und Entladevorgänge.",
                        "The Wheeled Loader combines versatility, mobility, and power for efficient material handling in construction and industrial settings. Its articulated steering and four-wheel drive system enable excellent maneuverability in confined spaces, while the quick-attach system allows for rapid switching between various attachments. The panoramic cabin provides outstanding visibility in all directions, enhancing operational safety and productivity. With its balanced power-to-weight ratio and fuel-efficient engine, this loader delivers optimal performance with reduced operating costs.": "Der Radlader kombiniert Vielseitigkeit, Mobilität und Leistung für eine effiziente Materialhandhabung in der Bau- und Industriebranche. Das gelenkte Lenksystem und das Allradantriebssystem ermöglichen eine ausgezeichnete Manövrierfähigkeit in engen Räumen, während das Schnellwechselsystem einen schnellen Wechsel zwischen verschiedenen Anbaugeräten ermöglicht. Die Panoramakabine bietet eine hervorragende Sicht in alle Richtungen, was die Betriebssicherheit und Produktivität erhöht. Mit seinem ausgewogenen Verhältnis von Leistung zu Gewicht und dem kraftstoffeffizienten Motor bietet dieser Radlader optimale Leistung bei reduzierten Betriebskosten.",
                        "Loader": "Lader",
                        "Articulated steering system": "Gelenklenksystem",
                        "Quick-attach bucket system": "Schnellwechselsystem für Schaufeln",
                        "Panoramic operator cabin": "Panoramakabine des Bedieners",
                        "Four-wheel drive": "Allradantrieb",
                        "Ride control technology": "Fahrsteuerungstechnologie",
                        "Multiple work modes": "Mehrere Arbeitsmodi",

                        
                          "Double Drum Rollers": "Doppel-Trommelwalzen",
                          "Double drum rollers solution for urban construction projects with limited space.": "Lösung mit Doppel-Trommelwalzen für städtische Bauprojekte mit begrenztem Raum.",
                          "The Double Drum Roller is a powerful and efficient compaction machine designed for road construction, asphalt paving, and soil stabilization. Featuring two heavy-duty steel drums, this roller delivers uniform compression, ensuring a smooth and durable surface. Its hydrostatic drive system provides excellent maneuverability, while the vibration control technology enhances compaction efficiency. The ergonomic operator station offers superior visibility and comfort, allowing for precise control in various job site conditions. With its fuel-efficient engine and easy maintenance access, the Double Drum Roller is an essential machine for high-performance compaction tasks.": "Die Doppel-Trommelwalze ist eine leistungsstarke und effiziente Verdichtungsmaschine, die für den Straßenbau, Asphaltbelag und Bodenstabilisierung entwickelt wurde. Mit zwei robusten Stahltrommeln sorgt diese Walze für eine gleichmäßige Verdichtung, wodurch eine glatte und langlebige Oberfläche entsteht. Ihr hydrostatisches Antriebssystem bietet hervorragende Manövrierfähigkeit, während die Vibrationskontrolltechnologie die Verdichtungseffizienz steigert. Die ergonomische Bedienstation bietet überlegene Sichtbarkeit und Komfort, was eine präzise Steuerung unter verschiedenen Baustellenbedingungen ermöglicht. Mit ihrem kraftstoffeffizienten Motor und dem einfachen Wartungszugang ist die Doppel-Trommelwalze eine unverzichtbare Maschine für hochleistungsfähige Verdichtungsaufgaben.",
                          "Dual steel drum design": "Doppelte Stahltrommelkonstruktion",
                          "Hydrostatic drive system": "Hydrostatisches Antriebssystem",
                          "Vibration control technology": "Vibrationskontrolltechnologie",
                          "Adjustable water spray system": "Verstellbares Wassersprühsystem",
                          "Ergonomic operator station": "Ergonomische Bedienstation",

                          
                            "newsNotFound": "Nachricht nicht gefunden",
                            "newsNotFoundDescription": "Der gesuchte Nachrichtenartikel existiert nicht oder wurde entfernt.",
                            "backToNews": "Zurück zu den Nachrichten",
                            "backToAllNews": "Zurück zu allen Nachrichten",
                            
                              "Product Launch": "Produkteinführung",
                              "Events": "Veranstaltungen",
                              "Industry News": "Branchenneuigkeiten",
                              
                                "Mini excavators - compact and efficient construction tools": "Minibagger - kompakte und effiziente Baumaschinen",
                                "1. Small and flexible": "1. Klein und flexibel",
                                "Small size: suitable for small Spaces and complex environments, such as urban streets, indoor": "Kleine Größe: geeignet für kleine Räume und komplexe Umgebungen wie Stadtstraßen und Innenräume.",
                                "construction and landscaping.": "Bau- und Landschaftsgestaltung.",
                                "Easy operation: small turning radius, flexible movement, suitable for fine construction tasks.": "Einfache Bedienung: kleiner Wendekreis, flexible Bewegung, geeignet für präzise Bauarbeiten.",
                                "2. Versatility": "2. Vielseitigkeit",
                                "Equipped with a variety of accessories: such as crushing hammer, clamp, drilling machine,": "Ausgestattet mit verschiedenen Zubehörteilen: wie Abbruchhammer, Greifer, Bohrmaschine,",
                                "dozer shovel, etc., to meet the digging, crushing, cleaning, drilling and other construction needs.": "Planierraupe usw., um Grab-, Abbruch-, Reinigungs-, Bohr- und andere Bauaufgaben zu erfüllen.",
                                "Multi-purpose: It can replace a variety of equipment to complete a variety of work and improve the use value.": "Mehrzweck: Kann verschiedene Geräte ersetzen, um eine Vielzahl von Arbeiten zu erledigen und den Nutzwert zu erhöhen.",
                                "3. Work efficiently": "3. Effizientes Arbeiten",
                                "Sufficient power: Despite its small size, the engine and hydraulic system are powerful and can complete excavation tasks quickly and efficiently.": "Ausreichende Leistung: Trotz der geringen Größe sind Motor und Hydrauliksystem leistungsstark und können Grabungsarbeiten schnell und effizient erledigen.",
                                "Precise operation: The precise control of the hydraulic system makes it excellent in fine operation.": "Präzise Steuerung: Die präzise Steuerung des Hydrauliksystems macht es hervorragend für feine Arbeiten.",
                                
                                  "MOTORCADE-TECHNOLOGY Backhoe loader with powerful functions and excellent performance!": "MOTORCADE-TECHNOLOGY Baggerlader mit leistungsstarken Funktionen und hervorragender Leistung!",
                                  "Has the following product features and advantages:": "Hat die folgenden Produkteigenschaften und Vorteile:",
                                  "Versatility: It can be used for both excavation and loading operations. One machine can be used for multiple purposes, saving costs.": "Vielseitigkeit: Kann sowohl für Grab- als auch für Ladeoperationen verwendet werden. Eine Maschine für mehrere Zwecke spart Kosten.",
                                  "High efficiency and energy saving: Using advanced power system and hydraulic system, it has low power consumption, high efficiency, energy saving and environmental protection.": "Hohe Effizienz und Energieeinsparung: Dank eines fortschrittlichen Antriebs- und Hydrauliksystems verfügt es über einen geringen Energieverbrauch, hohe Effizienz, Energieeinsparung und Umweltschutz.",
                                  "Strong stability: Equipped with a stable chassis and high-quality suspension system, the operation is smooth, safe and reliable.": "Hohe Stabilität: Ausgestattet mit einem stabilen Fahrgestell und einem hochwertigen Federungssystem, ist der Betrieb reibungslos, sicher und zuverlässig.",
                                  "Durable and wear-resistant: Using high-quality materials and precision manufacturing": "Langlebig und verschleißfest: Verwendung hochwertiger Materialien und Präzisionsfertigung",
                                  "technology, it is wear-resistant and durable, and will not be easily damaged after long-term use.": "Technologie, die verschleißfest und langlebig ist und auch bei langfristiger Nutzung nicht leicht beschädigt wird.",
                                  "Backhoe loaders help you easily cope with various construction tasks and are an indispensable": "Baggerlader helfen Ihnen, verschiedene Bauaufgaben mühelos zu bewältigen, und sind ein unverzichtbares",
                                  "tool for your construction projects!": "Werkzeug für Ihre Bauprojekte!",
                                  
                                    "4 wheel drive front articulated off-road forklift": "Geländegabelstapler mit Allradantrieb und Frontgelenk",
                                    "The front-articulated 4×4 off-road forklift is a powerful tool designed for complex terrain and": "Der frontgelenkte 4×4-Geländegabelstapler ist ein leistungsstarkes Werkzeug für schwieriges Gelände und",
                                    "harsh environments. Its unique front hinge design enables the vehicle to have better handling": "raue Umgebungen. Sein einzigartiges Frontgelenkdesign ermöglicht eine bessere Handhabung",
                                    "and passing performance, and can easily cope with various complex terrains and obstacles.": "und bessere Geländegängigkeit, wodurch er sich mühelos an verschiedene anspruchsvolle Gelände und Hindernisse anpassen kann.",
                                    "This off-road forklift is equipped with a powerful power system and stable chassis structure,": "Dieser Geländegabelstapler ist mit einem leistungsstarken Antriebssystem und einer stabilen Fahrwerksstruktur ausgestattet,",
                                    "which can drive stably on steep hillsides, muddy roads and rugged terrains. At the same time,": "was ihm eine stabile Fahrt auf steilen Hängen, schlammigen Wegen und unwegsamem Gelände ermöglicht. Gleichzeitig",
                                    "the precise steering system and flexible suspension system allow the driver to easily cope with": "sorgt das präzise Lenksystem in Kombination mit einem flexiblen Fahrwerkssystem dafür, dass der Fahrer sich",
                                    "various challenges and improve work efficiency and safety.": "mühelos verschiedenen Herausforderungen stellen kann, um die Arbeitseffizienz und Sicherheit zu verbessern.",
                                    "Whether working in the field, on a construction site, or in the farmland, front-articulated": "Ob auf dem Feld, auf einer Baustelle oder in der Landwirtschaft – frontgelenkte",
                                    "rough-terrain forklifts deliver outstanding performance, helping users complete tasks quickly.": "Geländegabelstapler bieten herausragende Leistung und helfen den Benutzern, Aufgaben schnell zu erledigen.",
                                    "Its durability and reliability have also been well received by users, making it your best choice in": "Seine Haltbarkeit und Zuverlässigkeit wurden von Nutzern sehr geschätzt, was ihn zur besten Wahl für",
                                    "harsh environments. Choose a front-articulated rough-terrain forklift to make your work more": "harte Umgebungen macht. Entscheiden Sie sich für einen frontgelenkten Geländegabelstapler, um Ihre Arbeit",
                                    "efficient, safer and smoother!": "effizienter, sicherer und reibungsloser zu gestalten!",
                                    
                                      "🌟 2025, let the dream further! 🌟": "🌟 2025, lass den Traum weitergehen! 🌟",
                                      "The gears of time are quietly turning, and we have ushered in 2025. Thank you for your company and support. It is your trust and encouragement that keeps us moving forward.": "Die Zahnräder der Zeit drehen sich leise, und wir haben das Jahr 2025 eingeläutet. Vielen Dank für eure Begleitung und Unterstützung. Euer Vertrauen und eure Ermutigung treiben uns weiter voran.",
                                      "🎉 The New Year bell rings, a new story is about to begin!": "🎉 Die Neujahrsglocke läutet, eine neue Geschichte beginnt!",
                                      "✨ By 2025, we commit to:": "✨ Bis 2025 verpflichten wir uns zu:",
                                      "Adhere to quality: to bring you better service and products;": "Qualität beibehalten: um Ihnen besseren Service und Produkte zu bieten;",
                                      "Service with heart: Every feedback is the driving force for our growth;": "Service mit Herz: Jedes Feedback ist der Antrieb für unser Wachstum;",
                                      "Progress together: Work together to create a better future!": "Gemeinsam voranschreiten: Lassen Sie uns zusammen eine bessere Zukunft gestalten!",
                                      "In the New Year, may your life be full of love and hope, and may our cooperation be more brilliant!": "Im neuen Jahr möge dein Leben voller Liebe und Hoffnung sein, und möge unsere Zusammenarbeit noch erfolgreicher sein!",
                                      "Let's make a better 2025 together!": "Lasst uns gemeinsam ein besseres 2025 gestalten!",
                                      
                                        "\"Self-loading flat mouth mixer truck\"---small and flexible concrete mixer truck": "\"Selbstladender Betonmischer mit flacher Öffnung\"---kleiner und flexibler Betonmischer",
                                        "This type of mixer truck is easier to operate in narrow construction sites. They are also suitable": "Diese Art von Betonmischer ist einfacher auf engen Baustellen zu bedienen. Sie sind auch geeignet",
                                        "for projects with frequent movement between different construction sites. It adopts flat mouth": "für Projekte mit häufigem Wechsel zwischen verschiedenen Baustellen. Er verwendet eine flache Öffnung",
                                        "mixing and double-sided hydraulic control for discharging. Its operating efficiency can reach 6-": "zum Mischen und eine beidseitige hydraulische Steuerung für die Entladung. Seine Betriebseffizienz kann 6-",
                                        "7 batches per hour, 14 cubic meters per hour. It adopts a domestic supercharged engine with a": "7 Chargen pro Stunde erreichen, 14 Kubikmeter pro Stunde. Er verfügt über einen inländischen Turbomotor mit einer",
                                        "speed of 2200 rpm, a rated power of 60kw, double high and low speed, and a low speed of 0-20": "Drehzahl von 2200 U/min, einer Nennleistung von 60 kW, einer doppelten Hoch- und Niedriggeschwindigkeit und einer niedrigen Geschwindigkeit von 0-20",
                                        "km/h, high speed 0-35 km/h, its water supply system is a self-priming 24v centrifugal pump,": "km/h, hoher Geschwindigkeit von 0-35 km/h, sein Wasserversorgungssystem ist eine selbstansaugende 24-V-Zentrifugalpumpe,",
                                        "24v self-adjusting centrifugal pump, its tires use 20.5-16 herringbone tires, the self-loading flat-": "eine selbstregulierende 24-V-Zentrifugalpumpe, seine Reifen sind 20.5-16 Fischgrätenreifen, der selbstladende flache",
                                        "mouth mixer can be efficient in concrete mixing and transportation, thus saving time and labor costs.": "Betonmischer kann effizient beim Mischen und Transportieren von Beton sein, wodurch Zeit und Arbeitskosten gespart werden.",
                                        "All in all, we are very proud to launch the upgraded version of the self-loading flat mouth mixer": "Alles in allem sind wir sehr stolz darauf, die verbesserte Version des selbstladenden Betonmischers mit flacher Öffnung",
                                        "truck. We believe that this upgraded version of the mixer truck can become a powerful": "auf den Markt zu bringen. Wir glauben, dass diese verbesserte Version des Betonmischers eine leistungsstarke",
                                        "assistant for construction workers and create a better and more efficient construction environment.": "Hilfe für Bauarbeiter sein und eine bessere sowie effizientere Bauumgebung schaffen kann.",
                                        
                                          "MOTORCADE TECHNOLOGY—Leads the new era of intelligent building materials": "MOTORCADE TECHNOLOGY—Führt die neue Ära intelligenter Baumaterialien an",
                                          "Recently, mixing trucks have been exported to Southeast Asia, South America, the Middle East and Africa and other countries, widely used in road construction, residential development, bridge engineering and other fields. We firmly believe that quality products and perfect services will create greater value for global customers.": "Kürzlich wurden Mischlastwagen nach Südostasien, Südamerika, den Nahen Osten, Afrika und andere Länder exportiert und sind weit verbreitet im Straßenbau, Wohnungsbau, Brückenbau und anderen Bereichen. Wir sind fest davon überzeugt, dass qualitativ hochwertige Produkte und perfekter Service einen größeren Wert für globale Kunden schaffen werden.",
                                          "In today's increasingly stringent environmental regulations, we continue to optimize the product structure, introduce low energy consumption, high efficiency mixing trucks, reduce the carbon emissions in the construction process. At the same time, the introduction of intelligent systems makes the construction more accurate and efficient, and helps the industry to move towards sustainable development.": "Angesichts der zunehmend strengeren Umweltvorschriften optimieren wir weiterhin die Produktstruktur, führen energieeffiziente, hocheffiziente Mischlastwagen ein und reduzieren die CO₂-Emissionen im Bauprozess. Gleichzeitig macht die Einführung intelligenter Systeme den Bau präziser und effizienter und hilft der Branche, sich in Richtung nachhaltige Entwicklung zu bewegen.",
                                         "MOTORCADE TECHNOLOGY always adheres to the concept of \"scientific and technological innovation, customer first\", and provides high-quality mixer equipment and high-quality after-sales service to customers around the world. In the future, we will continue to develop more advanced construction machinery and contribute China's intelligent manufacturing power to the global construction industry!": "MOTORCADE TECHNOLOGY hält stets an dem Konzept der \"wissenschaftlichen und technologischen Innovation, Kunde zuerst\" fest und bietet weltweit hochwertige Mischgeräte sowie einen erstklassigen After-Sales-Service. In Zukunft werden wir weiterhin fortschrittlichere Baumaschinen entwickeln und Chinas intelligente Fertigungskraft zur globalen Bauindustrie beitragen.",

                                         
                                          "Self-Loading Concrete Mixer Truck": "Selbstladender Betonmischer-LKW",
                                          
                                            "Truck": "LKW",
                                            "The Self-Loading Concrete Mixer Truck is an advanced and mobile concrete mixing solution designed for construction projects requiring on-site concrete production. Equipped with an automatic loading system, this truck eliminates the need for manual material handling, improving efficiency and reducing labor costs. Its powerful rotating drum ensures consistent and homogeneous mixing, while the 360-degree rotating cabin provides excellent maneuverability. Designed for rough terrains, the mixer truck is built with a robust chassis, all-terrain tires, and a high-performance engine. With precise water dosing and weighing systems, it guarantees optimal concrete quality for every batch.": "Der selbstladende Betonmischer-LKW ist eine fortschrittliche und mobile Lösung zum Mischen von Beton, die für Bauprojekte mit Betonproduktion vor Ort entwickelt wurde. Ausgestattet mit einem automatischen Ladesystem eliminiert dieser LKW die Notwendigkeit der manuellen Materialhandhabung, verbessert die Effizienz und senkt die Arbeitskosten. Seine leistungsstarke rotierende Trommel sorgt für eine gleichmäßige und homogene Mischung, während die um 360 Grad drehbare Kabine eine hervorragende Manövrierfähigkeit bietet. Für schwieriges Gelände konzipiert, verfügt der Mischer-LKW über ein robustes Fahrgestell, Geländereifen und einen Hochleistungsmotor. Mit präzisen Wasser-Dosierungs- und Wiegesystemen garantiert er eine optimale Betonqualität für jede Charge.",
                                            "Self-loading system for automatic material handling": "Selbstladendes System für automatische Materialhandhabung",
                                            "360-degree rotating cabin for enhanced maneuverability": "360-Grad drehbare Kabine für verbesserte Manövrierfähigkeit",
                                            "Heavy-duty rotating drum for uniform concrete mixing": "Schwerlast-Rührtrommel für gleichmäßige Betonmischung",
                                            "High-performance engine for rough terrain operations": "Hochleistungsmotor für den Einsatz im Gelände",
                                            "Integrated weighing and water dosing system": "Integriertes Wiege- und Wasserdosiersystem",
                                            "Ergonomic control panel for easy operation": "Ergonomisches Bedienfeld für einfache Bedienung",
                                            
                                              "Tractor Head": "Sattelzugmaschine",
                                              "The Tractor Head is a high-performance truck built for transporting heavy cargo over long distances. Designed to tow semi-trailers, it features a robust chassis, a powerful engine, and an advanced suspension system for stability and comfort. Equipped with modern safety features, aerodynamic design, and fuel-efficient technology, this vehicle ensures maximum productivity while minimizing operational costs. The spacious and ergonomic cabin provides comfort for long-haul drivers, making it an ideal choice for logistics and freight transport.": "Die Sattelzugmaschine ist ein leistungsstarker Lkw, der für den Transport schwerer Lasten über lange Strecken ausgelegt ist. Entwickelt zum Ziehen von Sattelanhängern, verfügt er über ein robustes Fahrgestell, einen leistungsstarken Motor und ein fortschrittliches Federungssystem für Stabilität und Komfort. Ausgestattet mit modernen Sicherheitsmerkmalen, aerodynamischem Design und kraftstoffsparender Technologie, sorgt dieses Fahrzeug für maximale Produktivität bei minimalen Betriebskosten. Die geräumige und ergonomische Kabine bietet Komfort für Fernfahrer und macht sie zur idealen Wahl für Logistik und Gütertransport.",
                                              "Powerful engine for heavy-duty towing": "Leistungsstarker Motor für Schwerlastanhänger",
                                              "Aerodynamic design for fuel efficiency": "Aerodynamisches Design für Kraftstoffeffizienz",
                                              "Advanced suspension for smooth handling": "Fortschrittliches Federungssystem für sanftes Handling",
                                              "Spacious and ergonomic driver cabin": "Geräumige und ergonomische Fahrerkabine",
                                              "Modern safety features for secure transport": "Moderne Sicherheitsmerkmale für sicheren Transport",
                                              "High-capacity fuel tank for long-haul journeys": "Hochkapazitätskraftstofftank für Langstreckenfahrten",
                                              
                                              
                                                "Dump Truck": "Kipper",
                                                "The Dump Truck is a rugged and powerful vehicle designed for hauling bulk materials efficiently. Built with a reinforced steel frame and a hydraulically operated dump bed, it ensures smooth loading and unloading of materials like sand, gravel, rocks, and debris. This truck is widely used in construction, mining, and roadwork projects, offering excellent durability and high load capacity. Its off-road capabilities, enhanced traction system, and powerful diesel engine allow it to navigate rough terrains with ease, making it an essential asset for heavy-duty transport needs.": "Der Kipper ist ein robustes und leistungsstarkes Fahrzeug, das für den effizienten Transport von Schüttgütern konzipiert ist. Mit einem verstärkten Stahlrahmen und einer hydraulisch betriebenen Kippmulde sorgt er für ein reibungsloses Be- und Entladen von Materialien wie Sand, Kies, Steinen und Bauschutt. Dieser Lkw wird häufig in Bau-, Bergbau- und Straßenbauprojekten eingesetzt und bietet eine hervorragende Haltbarkeit sowie eine hohe Ladekapazität. Dank seiner Geländetauglichkeit, des verbesserten Traktionssystems und des leistungsstarken Dieselmotors kann er problemlos auf schwierigem Terrain manövrieren und ist daher ein unverzichtbares Fahrzeug für den Schwerlasttransport.",
                                                "Hydraulically operated dump bed for easy unloading": "Hydraulisch betriebene Kippmulde für einfaches Entladen",
                                                "Heavy-duty steel chassis for durability": "Robuster Stahlrahmen für hohe Langlebigkeit",
                                                "High load capacity for bulk material transport": "Hohe Ladekapazität für den Schüttguttransport",
                                                "Advanced suspension system for stability": "Fortschrittliches Federungssystem für Stabilität",
                                                "Off-road capabilities for rough terrain operations": "Geländetauglichkeit für den Einsatz auf schwierigem Terrain",
                                                "Powerful diesel engine for maximum efficiency": "Leistungsstarker Dieselmotor für maximale Effizienz"
                                            
                                            
                                          
                                          
                                          
                                          
                                        
                                      


                                        
                                        
                                      
                                      
                                    
                                    
                                  
                                  
                                
                                
                              
                              
                            
                            
                          
                          
                        
                        
                      
                      
                    
                    
                  
                  
                
                
              
              
            
            
          
          
      
      
      
      


    
    
  
  
}
